zephyrproject-rtos/zephyr/drivers/dali/dali_lpc11u6x.c
/*
 * Copyright (c) 2025 by Sven Hädrich <sven.haedrich@sevenlab.de>
 * SPDX-License-Identifier: Apache-2.0
 */

#define DT_DRV_COMPAT nxp_dali_lpc11u6x

#include <zephyr/drivers/dali.h> /* api */

#include <zephyr/irq.h>
#include <zephyr/device.h>
#include <zephyr/devicetree.h>
#include <zephyr/kernel.h>
#include <zephyr/sys/util.h>

#include <zephyr/logging/log.h>
LOG_MODULE_REGISTER(dali_low_level, CONFIG_DALI_LOW_LEVEL_LOG_LEVEL);

#include "lpc11u6x.h" /* chip register definitions */
#include "timings.h"  /* timing constants from DALI standard */

#define DALI_TIMER_RATE_HZ      (1000000U)
#define DALI_RX_PORT            (0U)
#define DALI_RX_PIN             (12U)
#define DALI_RX_BIT             (1U << DALI_RX_PIN)
#define DALI_TX_PORT            (0U)
#define DALI_TX_PIN             (11U)
#define DALI_TX_BIT             (1U << DALI_TX_PIN)
#define GREY_AREA_BITTIMING_US  (18U)
#define GREY_AREA_INTERFRAME_US (800U)
#define DALI_TX_IDLE            false
#define DALI_TX_ACTIVE          true

#define DALI_MAX_DATA_LENGTH (32U)
/* start bit, 32 data bits, 1 stop bit */
#define COUNT_ARRAY_SIZE     (2U + DALI_MAX_DATA_LENGTH * 2U + 1U)

#define EXTEND_CORRUPT_PHASE 2
#define TX_CORRUPT_BIT_US    ((DALI_TX_CORRUPT_BIT_MAX_US + DALI_TX_CORRUPT_BIT_MIN_US) / 2)

static struct k_work_q dali_work_queue;
static K_KERNEL_STACK_DEFINE(dali_work_queue_stack, CONFIG_DALI_LPC11U6X_STACK_SIZE);

/**
 * @brief States for receive state machine.
 */
enum rx_state {
	IDLE,
	START_BIT_START,
	START_BIT_INSIDE,
	DATA_BIT_START,
	DATA_BIT_INSIDE,
	ERROR_IN_FRAME,
	DESTROY_FRAME,
	BUS_LOW,
	BUS_FAILURE_DETECT,
	TRANSMIT_BACKFRAME,
	STOPBIT_BACKFRAME,
};

enum rx_counter_event {
	CAPTURE,
	STOPBIT,
};

struct dali_lpc11u6x_tx_callback {
	dali_tx_callback_t function;
	void *user_data;
};

struct dali_lpc11u6x_rx_callback {
	dali_rx_callback_t function;
	void *user_data;
};

struct dali_lpc11u6x_callbacks {
	struct dali_lpc11u6x_tx_callback tx;
	struct dali_lpc11u6x_rx_callback rx;
};

struct dali_lpc11u6x_tx_data {
	uint32_t count[COUNT_ARRAY_SIZE];
	uint_fast8_t index_next;
	uint_fast8_t index_max;
	bool state_now;
	bool collision_detection;
	bool transmission_stop;
};

struct dali_lpc11u6x_rx_data {
	enum rx_state status;
	uint32_t data;
	uint8_t frame_length;
	bool last_data_bit;
	uint32_t tx_count_on_capture;
	uint32_t last_edge_count;
	uint32_t edge_count;
	enum rx_counter_event event;
};

struct dali_lpc11u6x_config {
	int32_t tx_rise_fall_delta_us;
	int32_t rx_rise_fall_delta_us;
	int32_t tx_rx_propagation_min_us;
	int32_t tx_rx_propagation_max_us;
	void (*irq_config_function)(void);
};

struct dali_lpc11u6x_data {
	const struct device *dev;
	struct dali_lpc11u6x_callbacks cb;
	struct dali_lpc11u6x_tx_data tx;
	struct dali_lpc11u6x_rx_data rx;
	struct k_work rx_work;
	struct k_mutex tx_mutex;
};

enum toggle_change {
	NOTHING,
	DISABLE_TOGGLE
};

static void dali_lpc11u6x_init_peripheral_clock(void)
{
	LPC_SYSCON->SYSAHBCLKCTRL |= (SYSAHBCLKCTRL_CT32B0 | SYSAHBCLKCTRL_CT32B1);
}

static void dali_lpc11u6x_init_io_pins(void)
{
	LPC_GPIO_PORT->dir[DALI_TX_PORT] |= DALI_TX_BIT;
	LPC_IOCON->pio0_12 =
		(IOCON_DAPIN_FUNC_MASK & IOCON_PIN0_12_FUNC_PIO) << IOCON_DAPIN_FUNC_SHIFT |
		(IOCON_DAPIN_MODE_MASK & IOCON_DAPIN_MODE_PULLUP) << IOCON_DAPIN_MODE_SHIFT |
		(IOCON_DAPIN_SMODE_MASK & 3U) << IOCON_DAPIN_SMODE_SHIFT |
		(IOCON_DAPIN_CLKDIV_MASK & 6U) << IOCON_DAPIN_CLKDIV_SHIFT;
}

static bool dali_lpc11u6x_get_rx_pin(void)
{
	return !(LPC_GPIO_PORT->pin[DALI_RX_PORT] & DALI_RX_BIT);
}

static void dali_lpc11u6x_set_tx_pin(bool state)
{
	LPC_IOCON->pio0_11 =
		(IOCON_DAPIN_FUNC_MASK & IOCON_PIN0_11_FUNC_PIO) << IOCON_DAPIN_FUNC_SHIFT |
		(IOCON_DAPIN_MODE_MASK & IOCON_DAPIN_MODE_PULLDOWN) << IOCON_DAPIN_MODE_SHIFT |
		(IOCON_DAPIN_ADMODE);
	if (state) {
		LPC_GPIO_PORT->set[DALI_TX_PORT] |= DALI_TX_BIT;
	} else {
		LPC_GPIO_PORT->clr[DALI_TX_PORT] |= DALI_TX_BIT;
	}
}

static void dali_lpc11u6x_stop_tx_counter(void)
{
	LPC_CT32B0->mcr = (LPC_CT32B0->mcr &
			   ~(CT32_MCR_MR0I | CT32_MCR_MR3I | CT32_MCR_MR3R | CT32_MCR_MR3S));
	LPC_CT32B0->emr = (CT32_EMR_EM2 | (CT32_EMR_EMCTR_NOTHING << CT32_EMR_EMC2_SHIFT));
}

static void dali_lpc11u6x_set_next_match_tx_counter(uint32_t count, enum toggle_change toggle)
{
	LPC_CT32B0->mr3 = count;
	if (toggle == DISABLE_TOGGLE) {
		LPC_CT32B0->emr &= ~(CT32_EMR_EMCTR_TOGGLE << CT32_EMR_EMC3_SHIFT);
	}
}

static uint32_t dali_lpc11u6x_get_tx_counter(void)
{
	return LPC_CT32B0->tc;
}

static void dali_lpc11u6x_set_collision_counter(uint32_t count)
{
	LPC_CT32B0->mr0 = count;
}

static void dali_lpc11u6x_init_tx_counter(uint32_t count, bool check_collision)
{
	LPC_CT32B0->tcr = CT32_TCR_CRST;
	dali_lpc11u6x_stop_tx_counter();
	dali_lpc11u6x_set_next_match_tx_counter(count, NOTHING);
	/* set prescaler to base rate */
	LPC_CT32B0->pr = (CONFIG_SYS_CLOCK_HW_CYCLES_PER_SEC / DALI_TIMER_RATE_HZ) - 1;
	/* set timer mode */
	LPC_CT32B0->ctcr = 0;
	/* on MR3 match: IRQ */
	LPC_CT32B0->mcr = (LPC_CT32B0->mcr & ~(CT32_MCR_MR3I | CT32_MCR_MR3R | CT32_MCR_MR3S)) |
			  (CT32_MCR_MR3I);
	/* for collision checking enable MR0 */
	if (check_collision) {
		LPC_CT32B0->mcr |= CT32_MCR_MR0I;
	} else {
		LPC_CT32B0->mcr &= ~CT32_MCR_MR0I;
	}
	/* on MR3 match: toggle output - start with DALI active */
	LPC_CT32B0->emr = CT32_EMR_EM3 | (CT32_EMR_EMCTR_TOGGLE << CT32_EMR_EMC3_SHIFT);
	/* outputs are controlled by EMx */
	LPC_CT32B0->pwmc = 0;
	/* pin function: CT32B0_MAT3 */
	/* function mode: no pull up/down resistors */
	/* hysteresis disabled */
	/* standard gpio */
	LPC_IOCON->pio0_11 =
		(IOCON_DAPIN_FUNC_MASK & IOCON_PIN0_11_FUNC_MAT3) << IOCON_DAPIN_FUNC_SHIFT |
		(IOCON_DAPIN_MODE_MASK & IOCON_DAPIN_MODE_PULLDOWN) << IOCON_DAPIN_MODE_SHIFT |
		(IOCON_DAPIN_ADMODE);
	/* start timer */
	LPC_CT32B0->tcr = CT32_TCR_CEN;
}

static uint32_t dali_lpc116x_get_rx_counter(void)
{
	return LPC_CT32B1->tc;
}

static uint32_t dali_lpc11u6x_get_rx_capture(void)
{
	return LPC_CT32B1->cr0;
}

static void dali_lpc11u6x_set_rx_counter(uint32_t match_count)
{
	LPC_CT32B1->mr0 = match_count;
}

