zephyrproject-rtos/zephyr/drivers/dali/dali_lpc11u6x.c
static void dali_lpc11u6x_enable_rx_counter(bool enable)
{
	if (enable) {
		LPC_CT32B1->mcr |= (CT32_MCR_MR0I);
	} else {
		LPC_CT32B1->mcr &= ~(CT32_MCR_MR0I);
	}
}

void dali_lpc11u6x_init_rx_counter(void)
{
	LPC_CT32B1->tcr = CT32_TCR_CRST;
	/* set prescaler to base rate */
	LPC_CT32B1->pr = (CONFIG_SYS_CLOCK_HW_CYCLES_PER_SEC / DALI_TIMER_RATE_HZ) - 1;
	/* set timer mode */
	LPC_CT32B1->ctcr = 0;
	/* capture both edges, trigger IRQ */
	LPC_CT32B1->ccr = (CT32_CCR_CAP0FE | CT32_CCR_CAP0RE | CT32_CCR_CAP0I);
	/* disable event matches */
	dali_lpc11u6x_enable_rx_counter(false);
	/* pin function: CT32B1_CAP0 */
	/* function mode: enable pull up resistor */
	/* hysteresis disabled */
	/* digital function mode, standard gpio */
	LPC_IOCON->pio0_12 =
		(IOCON_DAPIN_FUNC_MASK & IOCON_PIN0_12_FUNC_CAP0) << IOCON_DAPIN_FUNC_SHIFT |
		(IOCON_DAPIN_MODE_MASK & IOCON_DAPIN_MODE_PULLDOWN) << IOCON_DAPIN_MODE_SHIFT |
		(IOCON_DAPIN_ADMODE);
	/* start timer */
	LPC_CT32B1->tcr = CT32_TCR_CEN;
}

static void dali_lpc11u6x_add_signal_phase(struct dali_lpc11u6x_tx_data *tx, uint32_t duration_us,
					   bool change_last_phase)
{
	if (tx->index_max >= COUNT_ARRAY_SIZE || (change_last_phase && tx->index_max == 0)) {
		__ASSERT(true, "Access beyond array bounds");
		return;
	}

	if (change_last_phase) {
		tx->index_max--;
	}
	uint32_t count_now =
		(tx->index_max) ? (tx->count[tx->index_max - 1] + duration_us) : duration_us;
	tx->count[tx->index_max++] = count_now;
}

static void dali_lpc11u6x_add_bit(const struct device *dev, bool value)
{
	const struct dali_lpc11u6x_config *config = dev->config;
	struct dali_lpc11u6x_data *data = dev->data;

	uint32_t phase_one;
	uint32_t phase_two;
	bool change_previous = false;

	if (data->tx.state_now == value) {
		if (data->tx.state_now) {
			phase_one = DALI_TX_HALF_BIT_US + config->tx_rise_fall_delta_us;
			phase_two = DALI_TX_HALF_BIT_US - config->tx_rise_fall_delta_us;
		} else {
			phase_one = DALI_TX_HALF_BIT_US - config->tx_rise_fall_delta_us;
			phase_two = DALI_TX_HALF_BIT_US + config->tx_rise_fall_delta_us;
		}
	} else {
		change_previous = true;
		if (data->tx.state_now) {
			phase_one = DALI_TX_FULL_BIT_US - config->tx_rise_fall_delta_us;
			phase_two = DALI_TX_HALF_BIT_US + config->tx_rise_fall_delta_us;
		} else {
			phase_one = DALI_TX_FULL_BIT_US + config->tx_rise_fall_delta_us;
			phase_two = DALI_TX_HALF_BIT_US - config->tx_rise_fall_delta_us;
		}
	}
	dali_lpc11u6x_add_signal_phase(&data->tx, phase_one, change_previous);
	dali_lpc11u6x_add_signal_phase(&data->tx, phase_two, false);
	data->tx.state_now = value;
}

static void dali_lpc11u6x_add_stop_condition(struct dali_lpc11u6x_tx_data *tx)
{
	if (tx->state_now) {
		dali_lpc11u6x_add_signal_phase(tx, DALI_TX_STOP_BIT_US, true);
		tx->index_max--;
	} else {
		dali_lpc11u6x_add_signal_phase(tx, DALI_TX_STOP_BIT_US, false);
		tx->index_max--;
	}
}

static int dali_lpc11u6x_calculate_counts(const struct device *dev, const struct dali_frame *frame)
{
	uint_fast8_t length = 0;
	struct dali_lpc11u6x_data *data = dev->data;

	switch (frame->event_type) {
	case DALI_FRAME_CORRUPT:
		for (int_fast8_t i = 0; i < (2 * DALI_FRAME_BACKWARD_LENGTH); i++) {
			if (i == EXTEND_CORRUPT_PHASE) {
				dali_lpc11u6x_add_signal_phase(&data->tx, TX_CORRUPT_BIT_US, false);
			} else {
				dali_lpc11u6x_add_signal_phase(&data->tx, DALI_TX_HALF_BIT_US,
							       false);
			}
		}
		data->tx.collision_detection = false;
		return 0;
	case DALI_FRAME_BACKWARD:
		length = DALI_FRAME_BACKWARD_LENGTH;
		data->tx.collision_detection = false;
		break;
	case DALI_FRAME_GEAR:
		length = DALI_FRAME_GEAR_LENGTH;
		data->tx.collision_detection = true;
		break;
	case DALI_FRAME_DEVICE:
		length = DALI_FRAME_DEVICE_LENGTH;
		data->tx.collision_detection = true;
		break;
	default:
		return -EINVAL;
	}

	/* add start bit */
	dali_lpc11u6x_add_bit(dev, true);
	/* add data bits */
	for (int_fast8_t i = (length - 1); i >= 0; i--) {
		dali_lpc11u6x_add_bit(dev, frame->data & (1 << i));
	}

	dali_lpc11u6x_add_stop_condition(&data->tx);

	return 0;
}

static void dali_lpc11u6x_stop_tx(struct dali_lpc11u6x_data *data)
{
	if (data->tx.collision_detection && data->tx.index_next) {
		data->tx.transmission_stop = true;
		dali_lpc11u6x_stop_tx_counter();
		dali_lpc11u6x_set_tx_pin(DALI_TX_IDLE);
	}
}

static void dali_lpc11u6x_destroy_frame(struct dali_lpc11u6x_data *data)
{
	if (data->rx.status == DESTROY_FRAME) {
		return;
	}
	dali_lpc11u6x_stop_tx_counter();
	dali_lpc11u6x_set_tx_pin(DALI_TX_ACTIVE);
	data->rx.status = DESTROY_FRAME;

	/* use stopbit counter to time break condition. The timing is rather unrelieable and easily
	 * disturbed - it would be better to utilize the tx pwm
	 */
	const uint32_t break_count = dali_lpc116x_get_rx_counter() + DALI_TX_BREAK_MIN_US;

	dali_lpc11u6x_set_rx_counter(break_count);
	dali_lpc11u6x_enable_rx_counter(true);
}

void dali_lpc11u6x_handle_tx_callback_irq(const struct device *dev)
{
	struct dali_lpc11u6x_data *data = dev->data;
	const struct dali_lpc11u6x_config *config = data->dev->config;
	struct dali_lpc11u6x_tx_data *tx = &data->tx;

	/* schedule collision check for current transition */
	if (tx->collision_detection) {
		const uint32_t last_transition = tx->count[tx->index_next - 1];

		dali_lpc11u6x_set_collision_counter(last_transition +
						    config->tx_rx_propagation_min_us);
		tx->state_now = !tx->state_now;
	}

	/* schedule next level transition */
	if (tx->index_next < tx->index_max) {
		const uint32_t next_transition = tx->count[tx->index_next++];

		dali_lpc11u6x_set_next_match_tx_counter(next_transition, NOTHING);
		return;
	}

	/* schedule the last transition */
	if (tx->index_next == tx->index_max) {
		const uint32_t next_transition = tx->count[tx->index_next++];

		dali_lpc11u6x_set_next_match_tx_counter(next_transition, DISABLE_TOGGLE);
		if (data->rx.status == TRANSMIT_BACKFRAME) {
			data->rx.status = STOPBIT_BACKFRAME;
		}
		return;
	}

	/* activities at end of frame */
	dali_lpc11u6x_set_tx_pin(DALI_TX_IDLE);
	dali_lpc11u6x_stop_tx_counter();
}

