zephyrproject-rtos/zephyr/drivers/dali/dali_lpc11u6x.c
void dali_lpc11u6x_handle_collision_callback_irq(const struct device *dev)
{
	struct dali_lpc11u6x_data *data = dev->data;

	if (data->tx.index_next && dali_lpc11u6x_get_rx_pin() == data->tx.state_now) {
		dali_lpc11u6x_stop_tx(data);
		LOG_ERR("unexpected bus state while sending period %d -- stop transmission",
			data->tx.index_next);
	}
}

static void dali_lpc11u6x_handle_tx_irq(const struct device *dev)
{
	if (LPC_CT32B0->ir & CT32_IR_MR3INT) {
		LPC_CT32B0->ir = CT32_IR_MR3INT;
		dali_lpc11u6x_handle_tx_callback_irq(dev);
	}
	if (LPC_CT32B0->ir & CT32_IR_MR0INT) {
		LPC_CT32B0->ir = CT32_IR_MR0INT;
		dali_lpc11u6x_handle_collision_callback_irq(dev);
	}
}

static void dali_lpc11u6x_start_tx(struct dali_lpc11u6x_tx_data *tx)
{
	LOG_DBG("start_tx - index_max: %d", tx->index_max);
	tx->index_next = 1;
	tx->state_now = true;
	tx->transmission_stop = false;
	dali_lpc11u6x_init_tx_counter(tx->count[0], tx->collision_detection);
}

static void dali_lpc11u6x_reset_tx(struct dali_lpc11u6x_data *data)
{
	/* reset callbacks */
	data->cb.tx = (struct dali_lpc11u6x_tx_callback){0};
	/* reset pwm counts */
	data->tx = (struct dali_lpc11u6x_tx_data){.state_now = true};
}

static void dali_lpc11u6x_finish_rx_frame(struct dali_lpc11u6x_data *data)
{
	struct dali_frame frame = {
		.data = data->rx.data,
		.event_type = DALI_EVENT_NONE,
	};
	bool rx_cb = false;
	bool tx_cb = data->tx.transmission_stop;
	int err = tx_cb ? -ECANCELED : 0;

	switch (data->rx.status) {
	case START_BIT_START:
	case START_BIT_INSIDE:
	case DATA_BIT_START:
	case DATA_BIT_INSIDE:
		LOG_INF("{%02x: %08x}", data->rx.frame_length, data->rx.data);
		switch (data->rx.frame_length) {
		case DALI_FRAME_BACKWARD_LENGTH:
			frame.event_type = DALI_FRAME_BACKWARD;
			break;
		case DALI_FRAME_GEAR_LENGTH:
			frame.event_type = DALI_FRAME_GEAR;
			break;
		case DALI_FRAME_DEVICE_LENGTH:
			frame.event_type = DALI_FRAME_DEVICE;
			break;
		case DALI_FRAME_UPDATE_LENGTH:
			frame.event_type = DALI_FRAME_FIRMWARE;
			break;
		default:
			LOG_INF("invalid frame length %d bits", data->rx.frame_length);
			frame.data = 0, frame.event_type = DALI_FRAME_CORRUPT;
		}
		data->rx.status = IDLE;
		if (data->tx.collision_detection) {
			tx_cb = true;
		}
		rx_cb = true;
		break;
	case ERROR_IN_FRAME:
		if (data->tx.transmission_stop) {
			err = -ECOMM;
		} else {
			frame.data = 0, frame.event_type = DALI_FRAME_CORRUPT;
		}
		tx_cb = true;
		rx_cb = true;
		data->rx.status = IDLE;
		break;
	case BUS_FAILURE_DETECT:
		LOG_INF("bus failure");
		frame.data = 0, frame.event_type = DALI_EVENT_BUS_FAILURE;
		err = -EAGAIN;
		rx_cb = true;
		tx_cb = true;
		break;
	case IDLE:
		LOG_INF("bus idle");
		frame.data = 0, frame.event_type = DALI_EVENT_BUS_IDLE;
		rx_cb = true;
		break;
	default:
		__ASSERT(false, "invalid state");
	}
	if (data->cb.tx.function && tx_cb) {
		(data->cb.tx.function)(data->dev, err, data->cb.tx.user_data);
	}
	if (data->cb.rx.function && rx_cb) {
		(data->cb.rx.function)(data->dev, frame, data->cb.rx.user_data);
	}
}

static bool dali_lpc11u6x_is_valid_halfbit_timing(const uint32_t time_difference_us)
{
	if ((time_difference_us > DALI_RX_BIT_TIME_HALF_MAX_US + GREY_AREA_BITTIMING_US) ||
	    (time_difference_us < DALI_RX_BIT_TIME_HALF_MIN_US - GREY_AREA_BITTIMING_US)) {
		return false;
	}
	return true;
}

static bool dali_lpc11u6x_is_valid_fullbit_timing(const uint32_t time_difference_us)
{
	if ((time_difference_us > DALI_RX_BIT_TIME_FULL_MAX_US + GREY_AREA_BITTIMING_US) ||
	    (time_difference_us < DALI_RX_BIT_TIME_FULL_MIN_US - GREY_AREA_BITTIMING_US)) {
		return false;
	}
	return true;
}

static bool dali_lpc11u6x_is_destroy_start(const uint32_t time_difference_us)
{
	if ((time_difference_us > DALI_TX_DESTROY_1_MIN_US - GREY_AREA_BITTIMING_US) &&
	    (time_difference_us < DALI_TX_DESTROY_1_MAX_US + GREY_AREA_BITTIMING_US)) {
		return true;
	}
	if ((time_difference_us > DALI_TX_DESTROY_2_MIN_US + GREY_AREA_BITTIMING_US)) {
		return true;
	}
	return false;
}

static bool dali_lpc11u6x_is_destroy_inside(const uint32_t time_difference_us)
{
	if ((time_difference_us > DALI_TX_DESTROY_1_MIN_US - GREY_AREA_BITTIMING_US) &&
	    (time_difference_us < DALI_TX_DESTROY_1_MAX_US + GREY_AREA_BITTIMING_US)) {
		return true;
	}
	if ((time_difference_us > DALI_TX_DESTROY_2_MIN_US - GREY_AREA_BITTIMING_US) &&
	    (time_difference_us < DALI_TX_DESTROY_2_MAX_US + GREY_AREA_BITTIMING_US)) {
		return true;
	}
	if ((time_difference_us > DALI_TX_DESTROY_3_MIN_US - GREY_AREA_BITTIMING_US)) {
		return true;
	}
	return false;
}

static uint32_t dali_lpc11u6x_get_time_difference_us(const struct dali_lpc11u6x_data *data,
						     bool invert)
{
	const struct dali_lpc11u6x_config *config = data->dev->config;
	const uint32_t time_difference_us = data->rx.edge_count - data->rx.last_edge_count;

	if (data->rx.last_data_bit != invert) {
		return time_difference_us - config->rx_rise_fall_delta_us;
	}
	return time_difference_us + config->rx_rise_fall_delta_us;
}

static void dali_lpc11u6x_set_status(struct dali_lpc11u6x_data *data, enum rx_state new_status)
{
	switch (data->rx.status) {
	case ERROR_IN_FRAME:
	case DESTROY_FRAME:
		return;
	default:
		data->rx.status = new_status;
	}
}

static void dali_lpc11u6x_add_bit_to_rx_data(struct dali_lpc11u6x_data *data)
{
	data->rx.data = (data->rx.data << 1U) | (data->rx.last_data_bit ? (1U) : (0U));
	data->rx.frame_length++;
	if (data->rx.frame_length > DALI_MAX_BIT_PER_FRAME) {
		dali_lpc11u6x_set_status(data, ERROR_IN_FRAME);
	}
}

static enum rx_state dali_lpc11u6x_check_start_timing(struct dali_lpc11u6x_data *data)
{
	const uint32_t time_difference_us = dali_lpc11u6x_get_time_difference_us(data, false);

	if (data->tx.collision_detection && dali_lpc11u6x_is_destroy_start(time_difference_us)) {
		dali_lpc11u6x_destroy_frame(data);
		if (data->rx.status == START_BIT_START) {
			LOG_ERR("start bit collision, timing %d us, destroy frame",
				time_difference_us);
		} else {
			LOG_ERR("data bit %d collision, timing %d us, destroy frame",
				data->rx.frame_length, time_difference_us);
		}
		return DESTROY_FRAME;
	}

	if (!dali_lpc11u6x_is_valid_halfbit_timing(time_difference_us)) {
		dali_lpc11u6x_set_status(data, ERROR_IN_FRAME);
		if (data->rx.status == START_BIT_START) {
			LOG_ERR("start bit timing %d us, corrupt frame", time_difference_us);
		} else {
			LOG_ERR("data bit %d timing %d us, corrupt frame", data->rx.frame_length,
				time_difference_us);
		}
		return START_BIT_INSIDE;
	}

	if (data->rx.status == DATA_BIT_START) {
		dali_lpc11u6x_add_bit_to_rx_data(data);
		return DATA_BIT_INSIDE;
	}
	return START_BIT_INSIDE;
}

static enum rx_state dali_lpc11u6x_check_inside_timing(struct dali_lpc11u6x_data *data)
{
	uint32_t time_difference_us = dali_lpc11u6x_get_time_difference_us(data, true);

	if (data->tx.collision_detection && dali_lpc11u6x_is_destroy_inside(time_difference_us)) {
		dali_lpc11u6x_destroy_frame(data);
		if (data->rx.status == START_BIT_INSIDE) {
			LOG_ERR("inside start bit collision, timing %d us, destroy frame",
				time_difference_us);
		} else {
			LOG_ERR("inside bit %d collision, timing %d us, destroy frame",
				data->rx.frame_length, time_difference_us);
		}
		return DESTROY_FRAME;
	}

	if (dali_lpc11u6x_is_valid_halfbit_timing(time_difference_us)) {
		return DATA_BIT_START;
	}
	if (dali_lpc11u6x_is_valid_fullbit_timing(time_difference_us)) {
		data->rx.last_data_bit = !data->rx.last_data_bit;
		dali_lpc11u6x_add_bit_to_rx_data(data);
		return DATA_BIT_INSIDE;
	}
	if (data->rx.status == START_BIT_INSIDE) {
		LOG_ERR("inside start bit timing error %d us", time_difference_us);
	} else {
		LOG_ERR("inside data bit %d timing error %d us", data->rx.frame_length,
			time_difference_us);
	}
	return ERROR_IN_FRAME;
}

