zephyrproject-rtos/zephyr/drivers/dali/dali_lpc11u6x.c
static void dali_lpc11u6x_check_collision(struct dali_lpc11u6x_data *data)
{
	if (!data->tx.collision_detection) {
		return;
	}

	const struct dali_lpc11u6x_config *config = data->dev->config;
	const uint32_t expected_count = data->tx.count[data->tx.index_next - 2];
	const int32_t delay = data->rx.tx_count_on_capture - expected_count;

	if (delay < 0 || delay > config->tx_rx_propagation_max_us) {
		dali_lpc11u6x_stop_tx(data);
		LOG_ERR("unexpected capture with delay of %d us while receiving bit %d, stop "
			"transmission",
			delay, data->rx.frame_length);
	}
}

static void dali_lpc11u6x_process_capture_event(struct dali_lpc11u6x_data *data)
{
	data->rx.edge_count = dali_lpc11u6x_get_rx_capture();

	const uint32_t stop_timeout_count =
		data->rx.edge_count + DALI_RX_BIT_TIME_STOP_US - GREY_AREA_INTERFRAME_US;

	dali_lpc11u6x_set_rx_counter(stop_timeout_count);
	dali_lpc11u6x_enable_rx_counter(true);

	if (data->rx.status == DESTROY_FRAME || data->rx.status == ERROR_IN_FRAME) {
		data->rx.last_edge_count = dali_lpc116x_get_rx_counter();
		return;
	}

	if (data->rx.status == TRANSMIT_BACKFRAME || data->rx.status == STOPBIT_BACKFRAME) {
		data->rx.last_edge_count = data->rx.edge_count;
		return;
	}

	switch (data->rx.status) {
	case IDLE:
		if (!dali_lpc11u6x_get_rx_pin()) {
			dali_lpc11u6x_set_status(data, START_BIT_START);
			data->rx.last_data_bit = true;
			data->rx.data = 0;
			data->rx.frame_length = 0;
		}
		break;
	case START_BIT_START:
	case DATA_BIT_START:
		dali_lpc11u6x_check_collision(data);
		dali_lpc11u6x_set_status(data, dali_lpc11u6x_check_start_timing(data));
		break;
	case START_BIT_INSIDE:
	case DATA_BIT_INSIDE:
		dali_lpc11u6x_check_collision(data);
		dali_lpc11u6x_set_status(data, dali_lpc11u6x_check_inside_timing(data));
		break;
	case STOPBIT_BACKFRAME:
		break;
	case BUS_LOW:
		if (dali_lpc11u6x_get_rx_pin()) {
			dali_lpc11u6x_set_status(data, ERROR_IN_FRAME);
			dali_lpc11u6x_finish_rx_frame(data);
		}
		break;
	case BUS_FAILURE_DETECT:
		if (dali_lpc11u6x_get_rx_pin()) {
			data->rx.status = IDLE;
			dali_lpc11u6x_finish_rx_frame(data);
		}
		break;
	default:
		__ASSERT(false, "invalid state");
	}
	data->rx.last_edge_count = data->rx.edge_count;
}

static void dali_lpc11u6x_process_stopbit_event(struct dali_lpc11u6x_data *data)
{
	/* this can happen with extensive long bus active periods */
	if (data->rx.status == TRANSMIT_BACKFRAME) {
		/* re-start counter */
		const uint32_t stop_timeout_count =
			data->rx.edge_count + DALI_RX_BIT_TIME_STOP_US - GREY_AREA_INTERFRAME_US;

		dali_lpc11u6x_set_rx_counter(stop_timeout_count);
		dali_lpc11u6x_enable_rx_counter(true);
		return;
	}

	if (data->rx.status == DESTROY_FRAME) {
		dali_lpc11u6x_set_tx_pin(DALI_TX_IDLE);
		data->rx.status = ERROR_IN_FRAME;
		/* re-start counter */
		const uint32_t stop_timeout_count =
			data->rx.edge_count + DALI_RX_BIT_TIME_STOP_US - GREY_AREA_INTERFRAME_US;

		dali_lpc11u6x_set_rx_counter(stop_timeout_count);
		dali_lpc11u6x_enable_rx_counter(true);
		return;
	}

	if (dali_lpc11u6x_get_rx_pin()) {
		switch (data->rx.status) {
		case ERROR_IN_FRAME:
		case IDLE:
		case START_BIT_START:
		case START_BIT_INSIDE:
		case DATA_BIT_START:
		case DATA_BIT_INSIDE:
		case BUS_LOW:
		case BUS_FAILURE_DETECT:
			dali_lpc11u6x_finish_rx_frame(data);
			return;
		case STOPBIT_BACKFRAME:
			data->rx.status = IDLE;
			return;
		default:
			__ASSERT(false, "invalid state");
			return;
		}
	}
	switch (data->rx.status) {
	case BUS_LOW:
		data->rx.status = BUS_FAILURE_DETECT;
		dali_lpc11u6x_finish_rx_frame(data);
		break;
	case BUS_FAILURE_DETECT:
		break;
	default:
		dali_lpc11u6x_set_rx_counter(data->rx.edge_count + DALI_FAILURE_CONDITION_US);
		dali_lpc11u6x_enable_rx_counter(true);
		data->rx.status = BUS_LOW;
	}
}

static void dali_lpc11u6x_handle_work_queue(struct k_work *item)
{
	struct dali_lpc11u6x_data *data = CONTAINER_OF(item, struct dali_lpc11u6x_data, rx_work);

	switch (data->rx.event) {
	case CAPTURE:
		dali_lpc11u6x_process_capture_event(data);
		break;
	case STOPBIT:
		dali_lpc11u6x_process_stopbit_event(data);
		break;
	default:
		__ASSERT(false, "invalid event type");
	}
}

static void dali_lpc11u6x_handle_rx_irq(const struct device *dev)
{
	struct dali_lpc11u6x_data *data = dev->data;

	if (LPC_CT32B1->ir & CT32_IR_MR0INT) {
		LPC_CT32B1->ir = CT32_IR_MR0INT;
		dali_lpc11u6x_enable_rx_counter(false);

		data->rx.event = STOPBIT;
		k_work_submit_to_queue(&dali_work_queue, &data->rx_work);
	}
	if (LPC_CT32B1->ir & CT32_IR_CR0INT) {
		LPC_CT32B1->ir = CT32_IR_CR0INT;
		data->rx.event = CAPTURE;
		data->rx.tx_count_on_capture = dali_lpc11u6x_get_tx_counter();
		k_work_submit_to_queue(&dali_work_queue, &data->rx_work);
	}
}

static int dali_lpc11u6x_receive(const struct device *dev, dali_rx_callback_t callback,
				 void *user_data)
{
	struct dali_lpc11u6x_data *data = dev->data;

	data->cb.rx.function = callback;
	data->cb.rx.user_data = user_data;

	return 0;
}

static int dali_lpc11u6x_send(const struct device *dev, const struct dali_frame *frame,
			      dali_tx_callback_t callback, void *user_data)
{
	struct dali_lpc11u6x_data *data = dev->data;
	int result = 0;

	switch (frame->event_type) {
	case DALI_EVENT_NONE:
		break;
	case DALI_FRAME_GEAR:
	case DALI_FRAME_DEVICE:
	case DALI_FRAME_FIRMWARE:
		if (data->rx.status != IDLE) {
			result = -EINVAL;
			break;
		}
	case DALI_FRAME_CORRUPT:
	case DALI_FRAME_BACKWARD:
		k_mutex_lock(&data->tx_mutex, K_FOREVER);
		dali_lpc11u6x_reset_tx(data);
		data->cb.tx.function = callback;
		data->cb.tx.user_data = user_data;
		result = dali_lpc11u6x_calculate_counts(dev, frame);
		if (result == 0) {
			dali_lpc11u6x_start_tx(&data->tx);
		}
		k_mutex_unlock(&data->tx_mutex);
	default:
		result = -EINVAL;
	}

	return result;
}

static void dali_lpc11u6x_abort(const struct device *dev)
{
	dali_lpc11u6x_stop_tx_counter();
	dali_lpc11u6x_set_tx_pin(DALI_TX_IDLE);
}

static int dali_lpc11u6x_init(const struct device *dev)
{
	struct dali_lpc11u6x_data *data = dev->data;
	const struct dali_lpc11u6x_config *config = dev->config;

	/* connect to device */
	data->dev = dev;

	/* configure interrupts */
	if (config->irq_config_function != NULL) {
		config->irq_config_function();
	}

	/* set up send mutex */
	k_mutex_init(&data->tx_mutex);

