zephyrproject-rtos/zephyr/drivers/dali/dali_lpc11u6x.c
	/* set up receive work queue */
	const struct k_work_queue_config cfg = {
		.name = "DALI work",
		.no_yield = true,
		.essential = false,
	};
	k_work_queue_start(&dali_work_queue, dali_work_queue_stack,
			   K_KERNEL_STACK_SIZEOF(dali_work_queue_stack),
			   CONFIG_DALI_LPC11U6X_PRIORITY, &cfg);
	k_work_init(&data->rx_work, dali_lpc11u6x_handle_work_queue);

	/* initialize peripherals */
	dali_lpc11u6x_init_peripheral_clock();
	dali_lpc11u6x_init_io_pins();
	dali_lpc11u6x_set_tx_pin(DALI_TX_IDLE);
	dali_lpc11u6x_init_rx_counter();

	/* examine initial bus state */
	if (dali_lpc11u6x_get_rx_pin()) {
		data->rx.status = IDLE;
	} else {
		data->rx.status = BUS_LOW;
		dali_lpc11u6x_set_rx_counter(DALI_FAILURE_CONDITION_US);
		dali_lpc11u6x_enable_rx_counter(true);
	}
	return 0;
}

static DEVICE_API(dali, dali_lpc11u6x_driver_api) = {
	.receive = dali_lpc11u6x_receive,
	.send = dali_lpc11u6x_send,
	.abort = dali_lpc11u6x_abort,
};

#define DALI_LPC11U6X_INIT(idx)                                                                    \
	static void dali_lpc11u6x_config_irq_##idx(void)                                           \
	{                                                                                          \
		IRQ_CONNECT(DT_IRQ_BY_IDX(DT_DRV_INST(idx), 0, irq),                               \
			    DT_IRQ_BY_IDX(DT_DRV_INST(idx), 0, priority),                          \
			    dali_lpc11u6x_handle_tx_irq, DEVICE_DT_INST_GET(idx), 0);              \
		irq_enable(DT_IRQ_BY_IDX(DT_DRV_INST(idx), 0, irq));                               \
		IRQ_CONNECT(DT_IRQ_BY_IDX(DT_DRV_INST(idx), 1, irq),                               \
			    DT_IRQ_BY_IDX(DT_DRV_INST(idx), 1, priority),                          \
			    dali_lpc11u6x_handle_rx_irq, DEVICE_DT_INST_GET(idx), 0);              \
		irq_enable(DT_IRQ_BY_IDX(DT_DRV_INST(idx), 1, irq));                               \
	};                                                                                         \
	static struct dali_lpc11u6x_data dali_lpc11u6x_data_##idx = {0};                           \
	static const struct dali_lpc11u6x_config dali_lpc11u6x_config_##idx = {                    \
		.tx_rise_fall_delta_us = DT_INST_PROP_OR(idx, tx_rise_fall_delta_us, 0),           \
		.rx_rise_fall_delta_us = DT_INST_PROP_OR(idx, rx_rise_fall_delta_us, 0),           \
		.tx_rx_propagation_min_us = DT_INST_PROP_OR(idx, tx_rx_propagation_min_us, 1),     \
		.tx_rx_propagation_max_us = DT_INST_PROP_OR(idx, tx_rx_propagation_max_us, 100),   \
		.irq_config_function = dali_lpc11u6x_config_irq_##idx,                             \
	};                                                                                         \
	DEVICE_DT_INST_DEFINE(idx, dali_lpc11u6x_init, NULL, &dali_lpc11u6x_data_##idx,            \
			      &dali_lpc11u6x_config_##idx, POST_KERNEL,                            \
			      CONFIG_KERNEL_INIT_PRIORITY_DEVICE, &dali_lpc11u6x_driver_api);

DT_INST_FOREACH_STATUS_OKAY(DALI_LPC11U6X_INIT);
